Zlxwy/mspm0g3507_project/integrated_projects/encoder_ctrl_led_brightness/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for PWM_MOTOR */
#define PWM_MOTOR_INST                                                     TIMA1
#define PWM_MOTOR_INST_IRQHandler                               TIMA1_IRQHandler
#define PWM_MOTOR_INST_INT_IRQN                                 (TIMA1_INT_IRQn)
#define PWM_MOTOR_INST_CLK_FREQ                                         32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_MOTOR_C0_PORT                                             GPIOB
#define GPIO_PWM_MOTOR_C0_PIN                                      DL_GPIO_PIN_2
#define GPIO_PWM_MOTOR_C0_IOMUX                                  (IOMUX_PINCM15)
#define GPIO_PWM_MOTOR_C0_IOMUX_FUNC                 IOMUX_PINCM15_PF_TIMA1_CCP0
#define GPIO_PWM_MOTOR_C0_IDX                                DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_MOTOR_C1_PORT                                             GPIOB
#define GPIO_PWM_MOTOR_C1_PIN                                      DL_GPIO_PIN_3
#define GPIO_PWM_MOTOR_C1_IOMUX                                  (IOMUX_PINCM16)
#define GPIO_PWM_MOTOR_C1_IOMUX_FUNC                 IOMUX_PINCM16_PF_TIMA1_CCP1
#define GPIO_PWM_MOTOR_C1_IDX                                DL_TIMER_CC_1_INDEX




/* Port definition for Pin Group GPIO_OLED */
#define GPIO_OLED_PORT                                                   (GPIOB)

/* Defines for SCL: GPIOB.6 with pinCMx 23 on package pin 20 */
#define GPIO_OLED_SCL_PIN                                        (DL_GPIO_PIN_6)
#define GPIO_OLED_SCL_IOMUX                                      (IOMUX_PINCM23)
/* Defines for SDA: GPIOB.7 with pinCMx 24 on package pin 21 */
#define GPIO_OLED_SDA_PIN                                        (DL_GPIO_PIN_7)
#define GPIO_OLED_SDA_IOMUX                                      (IOMUX_PINCM24)
/* Port definition for Pin Group GPIO_ENCODER */
#define GPIO_ENCODER_PORT                                                (GPIOA)

/* Defines for PHASE_A: GPIOA.26 with pinCMx 59 on package pin 46 */
// pins affected by this interrupt request:["PHASE_A","PHASE_B"]
#define GPIO_ENCODER_INT_IRQN                                   (GPIOA_INT_IRQn)
#define GPIO_ENCODER_INT_IIDX                   (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define GPIO_ENCODER_PHASE_A_IIDX                           (DL_GPIO_IIDX_DIO26)
#define GPIO_ENCODER_PHASE_A_PIN                                (DL_GPIO_PIN_26)
#define GPIO_ENCODER_PHASE_A_IOMUX                               (IOMUX_PINCM59)
/* Defines for PHASE_B: GPIOA.27 with pinCMx 60 on package pin 47 */
#define GPIO_ENCODER_PHASE_B_IIDX                           (DL_GPIO_IIDX_DIO27)
#define GPIO_ENCODER_PHASE_B_PIN                                (DL_GPIO_PIN_27)
#define GPIO_ENCODER_PHASE_B_IOMUX                               (IOMUX_PINCM60)
/* Port definition for Pin Group GPIO_MOTOR */
#define GPIO_MOTOR_PORT                                                  (GPIOB)

/* Defines for LIN1: GPIOB.18 with pinCMx 44 on package pin 37 */
#define GPIO_MOTOR_LIN1_PIN                                     (DL_GPIO_PIN_18)
#define GPIO_MOTOR_LIN1_IOMUX                                    (IOMUX_PINCM44)
/* Defines for LIN2: GPIOB.14 with pinCMx 31 on package pin 24 */
#define GPIO_MOTOR_LIN2_PIN                                     (DL_GPIO_PIN_14)
#define GPIO_MOTOR_LIN2_IOMUX                                    (IOMUX_PINCM31)
/* Defines for RIN1: GPIOB.15 with pinCMx 32 on package pin 25 */
#define GPIO_MOTOR_RIN1_PIN                                     (DL_GPIO_PIN_15)
#define GPIO_MOTOR_RIN1_IOMUX                                    (IOMUX_PINCM32)
/* Defines for RIN2: GPIOB.9 with pinCMx 26 on package pin 23 */
#define GPIO_MOTOR_RIN2_PIN                                      (DL_GPIO_PIN_9)
#define GPIO_MOTOR_RIN2_IOMUX                                    (IOMUX_PINCM26)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_MOTOR_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
